# Read and Write CSV and XLS files

In [1]:
import pandas as pd
df = pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [6]:
#INSTALL: pip3 install xlrd

#read excel file
df = pd.read_excel('weather_data.xlsx')

XLRDError: Excel xlsx file; not supported

In [3]:
df.to_csv('new.csv')

In [4]:
df.to_csv('new_noIndex.csv', index=False)

In [5]:
#INSTALL: pip3 install openpyx

#write DF to excel
df.to_excel('new.xlsx', sheet_name='weather_data')

## GROUP-BY

In [7]:
import pandas as pd
df = pd.read_csv('weather_data_cities.csv')
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [12]:
g = df.groupby('city')
g

In [13]:
for city, city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [14]:
g.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [15]:
print(g.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [16]:
print(g.mean())

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [17]:
print(g.describe())

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

### Concatenate Data Frames

In [18]:
import pandas as pd
india_weather = pd.DataFrame({
    "city": ["mumbai", "delhi", "banglore"],
    "temp": [32, 45, 30],
    "humidity": [80, 60, 78]
})


india_weather

       city  temp  humidity
0    mumbai    32        80
1     delhi    45        60
2  banglore    30        78

In [19]:
us_weather = pd.DataFrame({
    "city": ["new york", "chicago", "orlando"],
    "temp": [21, 14, 35],
    "humidity": [68, 65, 75]
})

us_weather

       city  temp  humidity
0  new york    21        68
1   chicago    14        65
2   orlando    35        75

In [23]:
df = pd.concat([india_weather, us_weather])
df

       city  temp  humidity
0    mumbai    32        80
1     delhi    45        60
2  banglore    30        78
0  new york    21        68
1   chicago    14        65
2   orlando    35        75

In [24]:
df = pd.concat([india_weather, us_weather], ignore_index=True)
df

       city  temp  humidity
0    mumbai    32        80
1     delhi    45        60
2  banglore    30        78
3  new york    21        68
4   chicago    14        65
5   orlando    35        75

In [25]:
df = pd.concat([india_weather, us_weather], axis=1)
df

       city  temp  humidity      city  temp  humidity
0    mumbai    32        80  new york    21        68
1     delhi    45        60   chicago    14        65
2  banglore    30        78   orlando    35        75

## Merge DataFrames

In [26]:
temp_df = pd.DataFrame({
    "city": ["mumbai", "delhi", "banglore", "hyderabad"],
    "temp": [32, 45, 30, 40],
})

temp_df

        city  temp
0     mumbai    32
1      delhi    45
2   banglore    30
3  hyderabad    40

In [27]:
humidity_df = pd.DataFrame({
    "city": ["mumbai", "delhi", "banglore"],
     "humidity": [68, 65, 75]
})

humidity_df

       city  humidity
0    mumbai        68
1     delhi        65
2  banglore        75

In [29]:
df = pd.merge(temp_df, humidity_df, on='city')

df

       city  temp  humidity
0    mumbai    32        68
1     delhi    45        65
2  banglore    30        75

In [30]:
#OUTER_JOIN
df = pd.merge(temp_df, humidity_df, on='city', how='outer')

df

        city  temp  humidity
0     mumbai    32      68.0
1      delhi    45      65.0
2   banglore    30      75.0
3  hyderabad    40       NaN

## Numerical Indexing (.loc vs iloc)

In [32]:
df = pd.DataFrame([1,2,3,4,5,6,7,8,9,19], index=[49,48,47,46,45,1,2,3,4,5,])
df

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
5   19

In [35]:
df.loc[46]

0    4
Name: 46, dtype: int64

In [36]:
df.iloc[:2]

    0
49  1
48  2